src/main/resources/request/SendCreateAppointmentRequestMessage.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:mes="http://schemas.consiliumtechnologies.com/services/mobile/2009/03/messaging" xmlns:ref="http://schemas.consiliumtechnologies.com/mobile/2013/07/ReferralsMessages.xsd" xmlns:ref1="http://schemas.consiliumtechnologies.com/mobile/2013/07/ReferralsTypes.xsd" xmlns:com="http://schemas.consiliumtechnologies.com/mobile/2009/03/CommonTypes.xsd" xmlns:opt="http://schemas.consiliumtechnologies.com/mobile/2015/05/OptimiseTypes.xsd">
    <soapenv:Header/>
    <soapenv:Body>
        <mes:SendCreateAppointmentRequestMessage>
            <!--Optional:-->
            <mes:SendMessageRequestInfo>
                <mes:QueueName>?</mes:QueueName>
                <!--Optional:-->
                <mes:CorrelationId>?</mes:CorrelationId>
                <mes:Key>?</mes:Key>
            </mes:SendMessageRequestInfo>
            <!--Optional:-->
            <mes:CreateAppointmentRequest>
                <ref:Appointment>
                    <ref1:Identity>
                        <!--Optional:-->
                        <ref1:Reference>?</ref1:Reference>
                        <ref1:Referral>
                            <!--Optional:-->
                            <ref1:Reference>?</ref1:Reference>
                        </ref1:Referral>
                    </ref1:Identity>
                    <!--Optional:-->
                    <ref1:RelationType>?</ref1:RelationType>
                    <!--Optional:-->
                    <ref1:Description>?</ref1:Description>
                    <ref1:WorkType>?</ref1:WorkType>
                    <!--Optional:-->
                    <ref1:Address>
                        <!--Optional:-->
                        <ref1:Name>?</ref1:Name>
                        <!--Optional:-->
                        <ref1:Line1>?</ref1:Line1>
                        <!--Optional:-->
                        <ref1:Line2>?</ref1:Line2>
                        <!--Optional:-->
                        <ref1:Line3>?</ref1:Line3>
                        <!--Optional:-->
                        <ref1:Line4>?</ref1:Line4>
                        <!--Optional:-->
                        <ref1:Line5>?</ref1:Line5>
                        <!--Optional:-->
                        <ref1:PostCode>?</ref1:PostCode>
                        <!--Optional:-->
                        <ref1:KeySafe>?</ref1:KeySafe>
                    </ref1:Address>
                    <ref1:Priority>?</ref1:Priority>
                    <ref1:Duration>?</ref1:Duration>
                    <!--Optional:-->
                    <ref1:WorkItemGuid>?</ref1:WorkItemGuid>
                    <!--Optional:-->
                    <ref1:SpecialInstructions>?</ref1:SpecialInstructions>
                    <!--Optional:-->
                    <ref1:Phone>
                        <!--Optional:-->
                        <ref1:Daytime>?</ref1:Daytime>
                        <!--Optional:-->
                        <ref1:Evening>?</ref1:Evening>
                        <!--Optional:-->
                        <ref1:Mobile>?</ref1:Mobile>
                    </ref1:Phone>
                    <!--Optional:-->
                    <ref1:Email>?</ref1:Email>
                    <!--Optional:-->
                    <ref1:HasLocation>?</ref1:HasLocation>
                    <!--Optional:-->
                    <ref1:DueDate>?</ref1:DueDate>
                    <!--Optional:-->
                    <ref1:Booking>
                        <com:StartDate>?</com:StartDate>
                        <com:EndDate>?</com:EndDate>
                    </ref1:Booking>
                    <ref1:Skills>
                        <!--Zero or more repetitions:-->
                        <ref1:Item>
                            <ref1:Code>?</ref1:Code>
                        </ref1:Item>
                    </ref1:Skills>
                    <!--Optional:-->
                    <ref1:Activities>
                        <!--Zero or more repetitions:-->
                        <ref1:Item>
                            <ref1:LineNo>?</ref1:LineNo>
                            <ref1:Type>?</ref1:Type>
                            <!--Optional:-->
                            <ref1:Code>?</ref1:Code>
                            <!--Optional:-->
                            <ref1:Description>?</ref1:Description>
                            <!--Optional:-->
                            <ref1:FormReference>?</ref1:FormReference>
                        </ref1:Item>
                    </ref1:Activities>
                    <!--Optional:-->
                    <ref1:MandatoryResource>
                        <opt:Username>?</opt:Username>
                    </ref1:MandatoryResource>
                    <!--Optional:-->
                    <ref1:ConcurrentAppointments>
                        <!--Zero or more repetitions:-->
                        <ref1:Appointment>
                            <ref1:Identity>
                                <!--Optional:-->
                                <ref1:Reference>?</ref1:Reference>
                                <ref1:Referral>
                                    <!--Optional:-->
                                    <ref1:Reference>?</ref1:Reference>
                                </ref1:Referral>
                            </ref1:Identity>
                            <ref1:WorkType>?</ref1:WorkType>
                            <!--Optional:-->
                            <ref1:Description>?</ref1:Description>
                            <!--Optional:-->
                            <ref1:SpecialInstructions>?</ref1:SpecialInstructions>
                        </ref1:Appointment>
                    </ref1:ConcurrentAppointments>
                    <!--Optional:-->
                    <ref1:RelatedAppointments>
                        <!--Zero or more repetitions:-->
                        <ref1:Appointment>
                            <!--Optional:-->
                            <ref1:Identity>
                                <!--Optional:-->
                                <ref1:Reference>?</ref1:Reference>
                                <ref1:Referral>
                                    <!--Optional:-->
                                    <ref1:Reference>?</ref1:Reference>
                                </ref1:Referral>
                            </ref1:Identity>
                            <!--Optional:-->
                            <ref1:RelationType>?</ref1:RelationType>
                            <!--Optional:-->
                            <ref1:WorkType>?</ref1:WorkType>
                            <!--Optional:-->
                            <ref1:Description>?</ref1:Description>
                            <!--Optional:-->
                            <ref1:SpecialInstructions>?</ref1:SpecialInstructions>
                            <!--Optional:-->
                            <ref1:Skills>
                                <!--Zero or more repetitions:-->
                                <ref1:Item>
                                    <ref1:Code>?</ref1:Code>
                                </ref1:Item>
                            </ref1:Skills>
                        </ref1:Appointment>
                    </ref1:RelatedAppointments>
                </ref:Appointment>
            </mes:CreateAppointmentRequest>
        </mes:SendCreateAppointmentRequestMessage>
    </soapenv:Body>
</soapenv:Envelope>